burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Source/gd32e502_mfcom.c
    /* clear timer pin configuration bits */
    temp &= ~MFCOM_TMCTL_TMPCFG;

    /* set timer pin outputmode */
    temp |= mode;
    MFCOM_TMCTL(timer) = temp;
}

/*!
    \brief      configure shifter pin mode
    \param[in]  shifter:  MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  outputmode:
      \arg         MFCOM_SHIFTER_PINCFG_INPUT: pin input
      \arg         MFCOM_SHIFTER_PINCFG_OPENDRAIN: pin open drain or bidirectional output enable 
      \arg         MFCOM_SHIFTER_PINCFG_BIDI: pin bidirectional output data 
      \arg         MFCOM_SHIFTER_PINCFG_OUTPUT: pin output 
    \param[out] none
    \retval     none
*/
void mfcom_shifter_pin_config(uint32_t shifter, uint32_t mode)
{
    uint32_t temp;
    temp = MFCOM_SCTL(shifter);

    /* clear shifter pin configuration bits */
    temp &= ~MFCOM_SCTL_SPCFG;

    /* set shifter pin outputmode */
    temp |= mode;
    MFCOM_SCTL(shifter) = temp;
}

/*!
    \brief      enable MFCOM timer in specific mode
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  timermode:
      \arg         MFCOM_TIMER_DISABLE: timer disabled
      \arg         MFCOM_TIMER_BAUDMODE: dual 8-bit counters baud/bit mode
      \arg         MFCOM_TIMER_PWMMODE: dual 8-bit counters PWM mode
      \arg         MFCOM_TIMER_16BITCOUNTER: single 16-bit counter mode
    \param[out] none
    \retval     none
*/
void mfcom_timer_enable(uint32_t timer, uint32_t timermode)
{
    uint32_t temp;
    temp = MFCOM_TMCTL(timer);

    /* clear timer mode bits */
    temp &= ~MFCOM_TMCTL_TMMOD;

    /* set timer mode */
    temp |= timermode;
    MFCOM_TMCTL(timer) = temp;
}

/*!
    \brief      enable MFCOM shifter in specific mode
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  shiftermode:
      \arg         MFCOM_SHIFTER_DISABLE: shifter is disabled
      \arg         MFCOM_SHIFTER_RECEIVE: receive mode
      \arg         MFCOM_SHIFTER_TRANSMIT: transmit mode
      \arg         MFCOM_SHIFTER_MATCH_STORE: match store mode
      \arg         MFCOM_SHIFTER_MATCH_CONTINUOUS: match continuous mode
    \param[out] none
    \retval     none
*/
void mfcom_shifter_enable(uint32_t shifter, uint32_t shiftermode)
{
    uint32_t temp;
    temp = MFCOM_SCTL(shifter);

    /* clear shifter mode bits */
    temp &= ~MFCOM_SCTL_SMOD;

    /* set shifter mode */
    temp |= shiftermode;
    MFCOM_SCTL(shifter) = temp;
}

/*!
    \brief      disable MFCOM timer
    \param[in]  timer:  MFCOM timer number
      \arg        MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_timer_disable(uint32_t timer)
{
    MFCOM_TMCTL(timer) &= ~MFCOM_TMCTL_TMMOD;
}

/*!
    \brief      disable MFCOM shifter
    \param[in]  shifter:  MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     none
*/
void mfcom_shifter_disable(uint32_t shifter)
{
    MFCOM_SCTL(shifter) &= ~MFCOM_SCTL_SMOD;
}

/*!
    \brief      set MFCOM timer compare value
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  compare: timer compare value
    \param[out] none
    \retval     none
*/
void mfcom_timer_cmpvalue_set(uint32_t timer, uint32_t compare)
{
    MFCOM_TMCMP(timer) = compare;
}

/*!
    \brief      get MFCOM timer compare value
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] timer compare value
    \retval     none
*/
uint32_t mfcom_timer_cmpvalue_get(uint32_t timer)
{
    return MFCOM_TMCMP(timer);
}

/*!
    \brief      set MFCOM timer disable mode
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[in]  dismode: configure conditions that can disable timers and stop decrement.
      \arg         MFCOM_TIMER_DISMODE_NEVER:                timer never disabled
      \arg         MFCOM_TIMER_DISMODE_PRE_TIMDIS:           timer disabled on timer x-1 disable
      \arg         MFCOM_TIMER_DISMODE_COMPARE:              timer disabled on timer compare
      \arg         MFCOM_TIMER_DISMODE_COMPARE_TRIGLOW:      timer disabled on timer compare and trigger Low
      \arg         MFCOM_TIMER_DISMODE_PINBOTH:              timer disabled on pin rising or falling edge
      \arg         MFCOM_TIMER_DISMODE_PINBOTH_TRIGHIGH      timer disabled on pin rising or falling edge provided trigger is high
      \arg         MFCOM_TIMER_DISMODE_TRIGFALLING           timer disabled on trigger falling edge
    \param[out] none
    \retval     none
*/
void mfcom_timer_dismode_set(uint32_t timer, uint32_t dismode)
{
    uint32_t temp;
    temp = MFCOM_TMCFG(timer);

    /* clear timer disable bits */
    temp &= ~MFCOM_TMCFG_TMDIS;

    /* set timer disable mode */
    temp |= dismode;
    MFCOM_TMCFG(timer) = temp;
}

/*!
    \brief      set MFCOM shifter stopbit
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  stopbit: shifter stop bit
      \arg         MFCOM_SHIFTER_STOPBIT_DISABLE: disable shifter stop bit
      \arg         MFCOM_SHIFTER_STOPBIT_LOW: set shifter stop bit to logic low level
      \arg         MFCOM_SHIFTER_STOPBIT_HIGH: set shifter stop bit to logic high level
    \param[out] none
    \retval     none
*/
void mfcom_shifter_stopbit_set(uint32_t shifter, uint32_t stopbit)
{
    uint32_t temp;
    temp = MFCOM_SCFG(shifter);

    /* clear shifter stop bit */
    temp &= ~MFCOM_SCFG_SSTOP;

    /* set shifter stop bit */
    temp |= stopbit;
    MFCOM_SCFG(shifter) = temp;
}

/*!
    \brief      write MFCOM shifter buffer 
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  data: 32-bit data
    \param[in]  rwmode: MFCOM read write mode
      \arg         MFCOM_RWMODE_NORMAL: read and write in normal mode
      \arg         MFCOM_RWMODE_BITSWAP: read and write in bit swapped mode
      \arg         MFCOM_RWMODE_BYTESWAP: read and write in byte swapped mode
      \arg         MFCOM_RWMODE_BITBYTESWAP: read and write in bit byte swapped mode
    \param[out] none
    \retval     none
*/
void mfcom_buffer_write(uint32_t shifter, uint32_t data, uint32_t rwmode)
{
    switch (rwmode){
    case MFCOM_RWMODE_NORMAL:
        /* write MFCOM shift buffer in MFCOM_RWMODE_NORMAL mode */
        MFCOM_SBUF(shifter) = data;
        break;
    case MFCOM_RWMODE_BITSWAP:
        /* write MFCOM shift buffer in MFCOM_RWMODE_BITSWAP mode */
        MFCOM_SBUFBIS(shifter) = data;
        break;
    case MFCOM_RWMODE_BYTESWAP:
        /* write MFCOM shift buffer in MFCOM_RWMODE_BYTESWAP mode */
        MFCOM_SBUFBYS(shifter) = data;
        break;
    case MFCOM_RWMODE_BITBYTESWAP:
        /* write MFCOM shift buffer in MFCOM_RWMODE_BITBYTESWAP mode */
        MFCOM_SBUFBBS(shifter) = data;
        break;
    default:
        break;
    }
}

/*!
    \brief      read MFCOM shifter buffer 
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[in]  rwmode: MFCOM read write mode
      \arg         MFCOM_RWMODE_NORMAL: read and write in normal mode
      \arg         MFCOM_RWMODE_BITSWAP: read and write in bit swapped mode
      \arg         MFCOM_RWMODE_BYTESWAP: read and write in byte swapped mode
      \arg         MFCOM_RWMODE_BITBYTESWAP: read and write in bit byte swapped mode
    \param[out] none
    \retval     data: 32-bit data
*/
uint32_t mfcom_buffer_read(uint32_t shifter, uint32_t rwmode)
{
    uint32_t data;
    switch (rwmode){
    case MFCOM_RWMODE_NORMAL:
        /* read MFCOM shift buffer in MFCOM_RWMODE_NORMAL mode */
        data = MFCOM_SBUF(shifter);
        break;
    case MFCOM_RWMODE_BITSWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BITSWAP mode */
        data = MFCOM_SBUFBIS(shifter);
        break;
    case MFCOM_RWMODE_BYTESWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BYTESWAP mode */
        data = MFCOM_SBUFBYS(shifter);
        break;
    case MFCOM_RWMODE_BITBYTESWAP:
        /* read MFCOM shift buffer in MFCOM_RWMODE_BITBYTESWAP mode */
        data = MFCOM_SBUFBBS(shifter);
        break;
    default:
        data = 0U;
        break;
    }
    return data;
}

/*!
    \brief      get MFCOM shifter flag
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_flag_get(uint32_t shifter)
{
    if(0U != (MFCOM_SSTAT & ((uint32_t)1U << shifter))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      get MFCOM shifter error flag
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_error_flag_get(uint32_t shifter)
{
    if(0U != (MFCOM_SERR & ((uint32_t)1U << shifter))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      get MFCOM timer flag
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_timer_flag_get(uint32_t timer)
{
    if(0U != (MFCOM_TMSTAT & ((uint32_t)1U << timer))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      get MFCOM shifter interrupt flag
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_interrupt_flag_get(uint32_t shifter)
{
    uint32_t interrupt_flag, interrupt_enable;
    
    interrupt_flag = MFCOM_SSTAT & ((uint32_t)1U << shifter);
    interrupt_enable = MFCOM_SSIEN & ((uint32_t)1U << shifter);
    
    /* judge shifter interrupt flag state */
    if(interrupt_flag & interrupt_enable){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      get MFCOM shifter error interrupt flag
    \param[in]  shifter: MFCOM shifter number
      \arg         MFCOM_SHIFTER_x(x=0..3)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mfcom_shifter_error_interrupt_flag_get(uint32_t shifter)
{
    uint32_t interrupt_flag, interrupt_enable;
    
